; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite5 - satellite
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	instrument13 - instrument
	instrument14 - instrument
	satellite7 - satellite
	instrument15 - instrument
	satellite8 - satellite
	instrument16 - instrument
	instrument17 - instrument
	instrument18 - instrument
	satellite9 - satellite
	instrument19 - instrument
	satellite10 - satellite
	instrument20 - instrument
	instrument21 - instrument
	instrument22 - instrument
	infrared0 - mode
	spectrograph1 - mode
	GroundStation3 - direction
	GroundStation0 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation1)
	(supports instrument1 spectrograph1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star9)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation3)
	(supports instrument5 spectrograph1)
	(supports instrument5 infrared0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet8)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 GroundStation3)
	(supports instrument8 infrared0)
	(supports instrument8 spectrograph1)
	(calibration_target instrument8 GroundStation2)
	(supports instrument9 spectrograph1)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
	(supports instrument10 infrared0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 GroundStation0)
	(supports instrument11 spectrograph1)
	(supports instrument11 infrared0)
	(calibration_target instrument11 Star4)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star6)
	(supports instrument12 spectrograph1)
	(supports instrument12 infrared0)
	(calibration_target instrument12 GroundStation2)
	(supports instrument13 infrared0)
	(supports instrument13 spectrograph1)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 spectrograph1)
	(calibration_target instrument14 GroundStation1)
	(on_board instrument12 satellite6)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Phenomenon5)
	(supports instrument15 infrared0)
	(supports instrument15 spectrograph1)
	(calibration_target instrument15 GroundStation1)
	(on_board instrument15 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Star9)
	(supports instrument16 infrared0)
	(supports instrument16 spectrograph1)
	(calibration_target instrument16 GroundStation2)
	(supports instrument17 infrared0)
	(supports instrument17 spectrograph1)
	(calibration_target instrument17 GroundStation2)
	(supports instrument18 spectrograph1)
	(supports instrument18 infrared0)
	(calibration_target instrument18 Star4)
	(on_board instrument16 satellite8)
	(on_board instrument17 satellite8)
	(on_board instrument18 satellite8)
	(power_avail satellite8)
	(pointing satellite8 Planet8)
	(supports instrument19 infrared0)
	(calibration_target instrument19 GroundStation1)
	(on_board instrument19 satellite9)
	(power_avail satellite9)
	(pointing satellite9 Planet8)
	(supports instrument20 infrared0)
	(supports instrument20 spectrograph1)
	(calibration_target instrument20 Star4)
	(supports instrument21 infrared0)
	(supports instrument21 spectrograph1)
	(calibration_target instrument21 GroundStation2)
	(supports instrument22 spectrograph1)
	(supports instrument22 infrared0)
	(calibration_target instrument22 GroundStation1)
	(on_board instrument20 satellite10)
	(on_board instrument21 satellite10)
	(on_board instrument22 satellite10)
	(power_avail satellite10)
	(pointing satellite10 GroundStation0)
)
(:goal (and
	(pointing satellite2 Planet8)
	(pointing satellite3 Planet7)
	(pointing satellite7 GroundStation0)
	(pointing satellite8 Star6)
	(have_image Phenomenon5 infrared0)
	(have_image Star6 infrared0)
	(have_image Planet7 infrared0)
	(have_image Planet8 infrared0)
	(have_image Star9 infrared0)
))

)

; plan
1. (turn_to satellite8 star6 planet8)
   deleted: (pointing satellite8 planet8)
   added: (pointing satellite8 star6)
   goals met: 1 of 9
2. (turn_to satellite7 groundstation0 star9)
   deleted: (pointing satellite7 star9)
   added: (pointing satellite7 groundstation0)
   goals met: 2 of 9
3. (turn_to satellite3 planet7 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet7)
   goals met: 3 of 9
4. (turn_to satellite2 star4 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 star4)
   goals met: 3 of 9
5. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 3 of 9
6. (calibrate satellite2 instrument3 star4)
   added: (calibrated instrument3)
   goals met: 3 of 9
7. (turn_to satellite2 planet7 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 planet7)
   goals met: 3 of 9
8. (take_image satellite2 planet7 instrument3 infrared0)
   added: (have_image planet7 infrared0)
   goals met: 4 of 9
9. (turn_to satellite2 phenomenon5 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 phenomenon5)
   goals met: 4 of 9
10. (take_image satellite2 phenomenon5 instrument3 infrared0)
   added: (have_image phenomenon5 infrared0)
   goals met: 5 of 9
11. (turn_to satellite2 star6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star6)
   goals met: 5 of 9
12. (take_image satellite2 star6 instrument3 infrared0)
   added: (have_image star6 infrared0)
   goals met: 6 of 9
13. (turn_to satellite2 star9 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star9)
   goals met: 6 of 9
14. (take_image satellite2 star9 instrument3 infrared0)
   added: (have_image star9 infrared0)
   goals met: 7 of 9
15. (turn_to satellite2 planet8 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 planet8)
   goals met: 8 of 9
16. (take_image satellite2 planet8 instrument3 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 9 of 9
